# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8_Patent1.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS
#activation: torch.nn.ReLU()
# 设置Conv类的默认激活函数
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 9, C2f, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
# AMSP_VConv特征提取，去噪防止细节丢失
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [64, 6, 2, 2]]     # 0-P1/2
## 64是输出通道数，3为kernel_size,2为stride，其他默认
#  - [-1, 1, SC, [128, 3, 2]]    # 1-P2/4
#  - [-1, 3, C2f, [128, True]]   # 2
#  - [-1, 1, SC, [256, 3, 2]]    # 3-P3/8
#  - [-1, 6, C2f, [256, True]]   # 4
#  - [-1, 1, SC, [512, 3, 2]]    # 5-P4/16
#  - [-1, 9, C2f, [512, True]]   # 6
#  - [-1, 1, SC, [1024, 3, 2]]   # 7-P5/32
#  - [-1, 3, C2f, [1024, True]]  # 8
#  - [-1, 1, SPPF, [1024, 5]]    # 9


# YOLOv8.0n head
head:
# 注意：[-1, 3, Custom_CBAM, [16, 7]]
## CBAM不改变输出,ratio=16,kernel_size=7

  - [-1, 1, FEM, [1024, 1, 0.1]] # 10
  - [6, 1, Custom_CBAM, [16, 7]]  # 11
  - [4, 1, CPFM, [256, 1]]# 12
# 只看输入，输出通道数不设定，因为输出通道数恒为输入通道数
#  - [-1,1, CPFM, [1024, 1 ]]# 12
#  - [6, 1, CPFM, [512, 1 ]]# 12
#  - [4, 1, CPFM, [256, 1]]# 12
#  - [ -1,1, Custom_CBAM, [1, 1]]# 12
#  - [ 6, 1, Custom_CBAM, [1, 1]]# 12
#  - [ 4, 1, Custom_CBAM, [1, 1]]# 12
#  - [ -1,1, FEM, [1024, 1, 0.1]]# 12
#  - [ 6, 1, FEM, [512, 1, 0.1]]# 12
#  - [ 4, 1, FEM, [256, 1, 0.1]]# 12
# cpfm:(c1, c2=None, stride=1, scale=0.1, map_reduce=8, cbam_ratio=16)

  - [10, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 15
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)

# 融合实验一
#head:
#
# - [4, 1, CPFM, [256, 1]] # 10
#
# - [ 9, 1, nn.Upsample, [ None, 2, "nearest" ] ]
# - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P4
# - [ -1, 3, C2f, [ 512 ] ] # 13
# - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
# - [ [ -1, 10 ], 1, Concat, [ 1 ] ] # cat backbone P3
# - [ -1, 3, C2f, [ 256 ] ] # 16 (P3/8-small)
#
# - [ -1, 1, Conv, [ 256, 3, 2 ] ]
# - [ [ -1, 13 ], 1, Concat, [ 1 ] ] # cat head P4
# - [ -1, 3, C2f, [ 512 ] ] # 19 (P4/16-medium)
#
# - [ -1, 1, Conv, [ 512, 3, 2 ] ]
# - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat head P5
# - [ -1, 3, C2f, [ 1024 ] ] # 22 (P5/32-large)
#
# - [ [ 16, 19, 22 ], 1, Detect, [ nc ] ] # Detect(P3, P4, P5)

# 融合实验二
#head:
#
# - [6, 1, Custom_CBAM, [1, 1]]  # 10
# - [4, 1, CPFM, [256, 1]] # 11
#
# - [ 9, 1, nn.Upsample, [ None, 2, "nearest" ] ]
# - [ [ -1, 10 ], 1, Concat, [ 1 ] ] # cat backbone P4*
# - [ -1, 3, C2f, [ 512 ] ] # 14
# - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
# - [ [ -1, 11 ], 1, Concat, [ 1 ] ] # cat backbone P3
# - [ -1, 3, C2f, [ 256 ] ] # 17 (P3/8-small)
#
# - [ -1, 1, Conv, [ 256, 3, 2 ] ]
# - [ [ -1, 14 ], 1, Concat, [ 1 ] ] # cat head P4
# - [ -1, 3, C2f, [ 512 ] ] # 20 (P4/16-medium)
#
# - [ -1, 1, Conv, [ 512, 3, 2 ] ]
# - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat head P5
# - [ -1, 3, C2f, [ 1024 ] ] # 23 (P5/32-large)
#
# - [ [ 17, 20, 23 ], 1, Detect, [ nc ] ] # Detect(P3, P4, P5)

# 融合实验三：
#head:
## 注意：[-1, 3, Custom_CBAM, [16, 7]]
### CBAM不改变输出,ratio=16,kernel_size=7
#
##  - [-1, 1, FEM, [1024, 1, 0.1]] # 10
#  - [6, 1, Custom_CBAM, [16, 7]]  # 10
##  - [4, 1, CPFM, [256, 1]]# 12
#
#  - [9, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 10], 1, Concat, [1]] # cat backbone P4
#  - [-1, 3, C2f, [512]] # 13
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#  - [-1, 3, C2f, [256]] # 16 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 13], 1, Concat, [1]] # cat head P4
#  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)
#
#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 9], 1, Concat, [1]] # cat head P5
#  - [-1, 3, C2f, [1024]] # 22 (P5/32-large)
#
#  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

# 融合实验四
#head:
## 注意：[-1, 3, Custom_CBAM, [16, 7]]
### CBAM不改变输出,ratio=16,kernel_size=7
#
#  - [-1, 1, FEM, [1024, 1, 0.1]] # 10
##  - [6, 1, Custom_CBAM, [16, 7]]  # 11
##  - [4, 1, CPFM, [256, 1]]# 12
#
#  - [10, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#  - [-1, 3, C2f, [512]] # 13
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#  - [-1, 3, C2f, [256]] # 16 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 13], 1, Concat, [1]] # cat head P4
#  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)
#
#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 10], 1, Concat, [1]] # cat head P5
#  - [-1, 3, C2f, [1024]] # 22 (P5/32-large)
#
#  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)